cassandra

In [ ]:
!pip install pyspark
!pip install findspark
!pip install pyarrow==1.0.0
!pip install pandas
!pip install numpy==1.19.5

In [ ]:
import findspark
findspark.init()
import pandas as pd
from pyspark import SparkContext, SparkConf
from pyspark.sql import SparkSession

In [ ]:
!pip install cassandra-driver

In [ ]:
import string
from cassandra.cluster import Cluster
from cassandra.auth import PlainTextAuthProvider
from numpy import datetime64

In [ ]:
import numpy as np
import matplotlib.pyplot as plt
import pandas as pd
from datetime import datetime

In [ ]:
df = pd.read_csv ('/content/Taxi_trips_20k.csv')

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 19999 entries, 0 to 19998
Data columns (total 17 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   vendor_id            19999 non-null  int64
 1   pickup_datetime      19999 non-null  object
 2   dropoff_datetime     19999 non-null  object
 3   passenger_count      19999 non-null  int64
 4   trip_distance        19999 non-null  float64
 5   rate_code            19999 non-null  int64
 6   store_and_fwd_flag   19999 non-null  object
 7   payment_type         19999 non-null  int64
 8   fare_amount          19999 non-null  float64
 9   extra                19999 non-null  float64
 10  mta_tax              19999 non-null  float64
 11  tip_amount           19999 non-null  float64
 12  tolls_amount         19999 non-null  float64
 13  imp_surcharge        19999 non-null  float64
 14  total_amount         19999 non-null  float64
 15  pickup_location_id   19999 non-null  int64
 16  dropoff_location_id  19999 non-null  int64
dtypes: float64(8), int64(6), object(3)
memory usage: 2.6+ MB

In [ ]:
taxi_zone = pd.read_csv ('taxi_zone_geo.csv')
taxi_zone.drop(taxi_zone.columns[3], axis=1, inplace=True)

In [ ]:
df.head()

,vendor_id,pickup_datetime,dropoff_datetime,passenger_count,trip_distance,rate_code,store_and_fwd_flag,payment_type,fare_amount,extra,mta_tax,tip_amount,tolls_amount,imp_surcharge,total_amount,pickup_location_id,dropoff_location_id
0,1,2018-05-11 17:40:16,2018-05-11 17:55:35,1,1.60,1,N,1,11.5,1.0,0.5,0.00,0.0,0.3,13.30,48,68
1,2,2018-03-22 23:01:41,2018-03-22 23:25:36,1,9.52,1,N,1,28.5,0.5,0.5,5.96,0.0,0.3,35.76,138,230
2,2,2018-07-24 09:58:45,2018-07-24 10:22:37,1,2.17,1,N,1,15.5,0.0,0.5,1.50,0.0,0.3,17.80,234,48
3,2,2018-12-21 18:28:55,2018-12-21 18:35:45,1,0.86,1,N,2,6.0,1.0,0.5,0.00,0.0,0.3,7.80,79,125
4,1,2018-08-15 13:58:39,2018-08-15 14:05:25,1,0.30,1,N,2,5.5,0.0,0.5,0.00,0.0,0.3,6.30,233,233

In [ ]:
df.isnull().sum()

vendor_id              0
pickup_datetime        0
dropoff_datetime       0
passenger_count        0
trip_distance          0
rate_code              0
store_and_fwd_flag     0
payment_type           0
fare_amount            0
extra                  0
mta_tax                0
tip_amount             0
tolls_amount           0
imp_surcharge          0
total_amount           0
pickup_location_id     0
dropoff_location_id    0
dtype: int64

In [ ]:
df=df.drop(['store_and_fwd_flag','rate_code','total_amount'],axis=1)

Remove vendors with id 4 as dataset desription mentioned vendor ids should only be 1or 2

In [ ]:
df['vendor_id'].unique()

array([1, 2, 4])

In [ ]:
df.drop( df[ (df['vendor_id'] != 1 ) & (df['vendor_id'] != 2 )].index, inplace = True)

In [ ]:
df['vendor_id'].unique()

array([1, 2])

remove records with missing values

In [ ]:
df.drop( df[ (df['passenger_count'] ==0 )].index, inplace = True)

In [ ]:
df=df[df['trip_distance']!=0]

In [ ]:
df=df[df['fare_amount']!=0]

the dataset description mentions that mta_tax should be 0.5

In [ ]:
df.drop( df[ (df['mta_tax'] != 0.5 ) ].index, inplace = True)

joining the datasets

In [ ]:
df.rename(columns = {'pickup_location_id':'zone_id'}, inplace = True)

In [ ]:
df= pd.merge(df,taxi_zone, on='zone_id', how='inner')

In [ ]:
df.head()

,vendor_id,pickup_datetime,dropoff_datetime,passenger_count,trip_distance,payment_type,fare_amount,extra,mta_tax,tip_amount,tolls_amount,imp_surcharge,zone_id,dropoff_location_id,zone_name,borough
0,1,2018-05-11 17:40:16,2018-05-11 17:55:35,1,1.60,1,11.5,1.0,0.5,0.0,0.0,0.3,48,68,Clinton East,Manhattan
1,1,2018-08-26 10:24:34,2018-08-26 10:32:20,2,1.20,2,7.5,0.0,0.5,0.0,0.0,0.3,48,43,Clinton East,Manhattan
2,2,2018-11-21 22:25:48,2018-11-21 22:42:56,1,2.40,2,12.5,0.5,0.5,0.0,0.0,0.3,48,137,Clinton East,Manhattan
3,1,2018-06-15 06:26:21,2018-06-15 06:34:04,1,1.10,1,7.0,0.0,0.5,2.3,0.0,0.3,48,162,Clinton East,Manhattan
4,2,2018-12-05 18:41:08,2018-12-05 18:53:30,2,1.35,1,9.0,1.0,0.5,3.0,0.0,0.3,48,68,Clinton East,Manhattan

converting the data type of the drop off and pick up time

In [ ]:
df['dropoff_datetime'] =  pd.to_datetime(df['dropoff_datetime'])

In [ ]:
df['pickup_datetime'] =  pd.to_datetime(df['pickup_datetime'])

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 19220 entries, 0 to 19219
Data columns (total 16 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   vendor_id            19220 non-null  int64
 1   pickup_datetime      19220 non-null  datetime64[ns]
 2   dropoff_datetime     19220 non-null  datetime64[ns]
 3   passenger_count      19220 non-null  int64
 4   trip_distance        19220 non-null  float64
 5   payment_type         19220 non-null  int64
 6   fare_amount          19220 non-null  float64
 7   extra                19220 non-null  float64
 8   mta_tax              19220 non-null  float64
 9   tip_amount           19220 non-null  float64
 10  tolls_amount         19220 non-null  float64
 11  imp_surcharge        19220 non-null  float64
 12  zone_id              19220 non-null  int64
 13  dropoff_location_id  19220 non-null  int64
 14  zone_name            19220 non-null  object
 15  borough              19220 non-null  object
dtypes: datetime64[ns](2), float64(7), int64(5), object(2)
memory usage: 2.5+ MB

In [ ]:
df['duration'] =df['dropoff_datetime'] - df['pickup_datetime']

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 19220 entries, 0 to 19219
Data columns (total 17 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   vendor_id            19220 non-null  int64
 1   pickup_datetime      19220 non-null  datetime64[ns]
 2   dropoff_datetime     19220 non-null  datetime64[ns]
 3   passenger_count      19220 non-null  int64
 4   trip_distance        19220 non-null  float64
 5   payment_type         19220 non-null  int64
 6   fare_amount          19220 non-null  float64
 7   extra                19220 non-null  float64
 8   mta_tax              19220 non-null  float64
 9   tip_amount           19220 non-null  float64
 10  tolls_amount         19220 non-null  float64
 11  imp_surcharge        19220 non-null  float64
 12  zone_id              19220 non-null  int64
 13  dropoff_location_id  19220 non-null  int64
 14  zone_name            19220 non-null  object
 15  borough              19220 non-null  object
 16  duration             19220 non-null  timedelta64[ns]
dtypes: datetime64[ns](2), float64(7), int64(5), object(2), timedelta64[ns](1)
memory usage: 2.6+ MB

converting the data type of the duration field

In [ ]:
for k in range(0,len(df)):
    df['duration'][k]=df.iloc[k].duration.seconds/60

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 19220 entries, 0 to 19219
Data columns (total 17 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   vendor_id            19220 non-null  int64
 1   pickup_datetime      19220 non-null  datetime64[ns]
 2   dropoff_datetime     19220 non-null  datetime64[ns]
 3   passenger_count      19220 non-null  int64
 4   trip_distance        19220 non-null  float64
 5   payment_type         19220 non-null  int64
 6   fare_amount          19220 non-null  float64
 7   extra                19220 non-null  float64
 8   mta_tax              19220 non-null  float64
 9   tip_amount           19220 non-null  float64
 10  tolls_amount         19220 non-null  float64
 11  imp_surcharge        19220 non-null  float64
 12  zone_id              19220 non-null  int64
 13  dropoff_location_id  19220 non-null  int64
 14  zone_name            19220 non-null  object
 15  borough              19220 non-null  object
 16  duration             19220 non-null  object
dtypes: datetime64[ns](2), float64(7), int64(5), object(3)
memory usage: 3.1+ MB

In [ ]:
df.head()

,vendor_id,pickup_datetime,dropoff_datetime,passenger_count,trip_distance,payment_type,fare_amount,extra,mta_tax,tip_amount,tolls_amount,imp_surcharge,zone_id,dropoff_location_id,zone_name,borough,duration
0,1,2018-05-11 17:40:16,2018-05-11 17:55:35,1,1.60,1,11.5,1.0,0.5,0.0,0.0,0.3,48,68,Clinton East,Manhattan,15.316667
1,1,2018-08-26 10:24:34,2018-08-26 10:32:20,2,1.20,2,7.5,0.0,0.5,0.0,0.0,0.3,48,43,Clinton East,Manhattan,7.766667
2,2,2018-11-21 22:25:48,2018-11-21 22:42:56,1,2.40,2,12.5,0.5,0.5,0.0,0.0,0.3,48,137,Clinton East,Manhattan,17.133333
3,1,2018-06-15 06:26:21,2018-06-15 06:34:04,1,1.10,1,7.0,0.0,0.5,2.3,0.0,0.3,48,162,Clinton East,Manhattan,7.716667
4,2,2018-12-05 18:41:08,2018-12-05 18:53:30,2,1.35,1,9.0,1.0,0.5,3.0,0.0,0.3,48,68,Clinton East,Manhattan,12.366667

discretizing pickup times

In [ ]:
def tod(date):
    if((date.hour>=5)&(date.hour<12)):
        return 'morning'
    if((date.hour>=12)&(date.hour<17)):
        return 'afternoon'
    if((date.hour>=17)&(date.hour<21)):
        return 'evening'
    else:
        return 'night'

In [ ]:
df['time_of_day']=df['pickup_datetime'].apply(lambda x:tod(x))

In [ ]:
df['dropoff_datetime'] = df['dropoff_datetime'].dt.strftime("%m/%d/%Y, %H:%M:%S")

In [ ]:
df['pickup_datetime'] = df['pickup_datetime'].dt.strftime("%m/%d/%Y, %H:%M:%S")

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 19220 entries, 0 to 19219
Data columns (total 18 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   vendor_id            19220 non-null  int64
 1   pickup_datetime      19220 non-null  object
 2   dropoff_datetime     19220 non-null  object
 3   passenger_count      19220 non-null  int64
 4   trip_distance        19220 non-null  float64
 5   payment_type         19220 non-null  int64
 6   fare_amount          19220 non-null  float64
 7   extra                19220 non-null  float64
 8   mta_tax              19220 non-null  float64
 9   tip_amount           19220 non-null  float64
 10  tolls_amount         19220 non-null  float64
 11  imp_surcharge        19220 non-null  float64
 12  zone_id              19220 non-null  int64
 13  dropoff_location_id  19220 non-null  int64
 14  zone_name            19220 non-null  object
 15  borough              19220 non-null  object
 16  duration             19220 non-null  object
 17  time_of_day          19220 non-null  object
dtypes: float64(7), int64(5), object(6)
memory usage: 3.3+ MB

In [ ]:
sc = SparkContext()

# Creating a spark session
spark = SparkSession \
    .builder \
    .appName("Python Spark DataFrames basic example") \
    .config("spark.some.config.option", "some-value") \
    .getOrCreate()

In [ ]:
sdf = spark.createDataFrame(df)

In [ ]:
sdf.createTempView("taxis")

In [ ]:
spark.sql("""SELECT time_of_day,payment_type,COUNT(*) number_of_trips 
FROM taxis 
GROUP BY time_of_day,payment_type 
ORDER BY number_of_trips DESC
""").show()

+-----------+------------+---------------+
|time_of_day|payment_type|number_of_trips|
+-----------+------------+---------------+
|    morning|           1|           3429|
|  afternoon|           1|           3336|
|      night|           1|           3290|
|    evening|           1|           3289|
|  afternoon|           2|           1671|
|    morning|           2|           1459|
|    evening|           2|           1343|
|      night|           2|           1319|
|  afternoon|           3|             22|
|    morning|           3|             18|
|    evening|           3|             13|
|      night|           3|             13|
|    morning|           4|              8|
|  afternoon|           4|              8|
|      night|           4|              1|
|    evening|           4|              1|
+-----------+------------+---------------+

In [ ]:
spark.sql("select passenger_count,ROUND(AVG(tip_amount),2) average_tip_amount from taxis GROUP BY passenger_count ORDER BY average_tip_amount DESC").show()

+---------------+------------------+
|passenger_count|average_tip_amount|
+---------------+------------------+
|              4|              1.92|
|              6|               1.9|
|              5|              1.83|
|              1|              1.82|
|              2|               1.8|
|              3|              1.77|
+---------------+------------------+

In [ ]:
spark.sql("select zone_id,zone_name,COUNT(*) number_of_trips from taxis GROUP BY zone_id,zone_name ORDER BY number_of_trips DESC LIMIT 5").show()

+-------+--------------------+---------------+
|zone_id|           zone_name|number_of_trips|
+-------+--------------------+---------------+
|    237|Upper East Side S...|            791|
|    161|      Midtown Center|            744|
|    236|Upper East Side N...|            713|
|    230|Times Sq/Theatre ...|            692|
|    162|        Midtown East|            667|
+-------+--------------------+---------------+

In [ ]:
sdf=spark.sql("select *,ROUND((fare_amount+extra+mta_tax+tip_amount+tolls_amount+imp_surcharge),2) total_amount FROM taxis")

In [ ]:
cloud_config= {
        'secure_connect_bundle': 'secure-connect-emad.zip' 
}
auth_provider = PlainTextAuthProvider("KpAyaTBpQgUhvfEigvHseUEm", "mkBTE383M9JJMUoYelZ_ktc_TSD_2Hg4zS6pZxmC8x1AvJxd75hG_1J5kyzq78ASFk0tvWdJcKYAMbFF-v4YmMDJHpQ4bgkqdbfMwB8Fz,kUyYxwly4g.5cf+Z-j.dxb") 
cluster = Cluster(cloud=cloud_config, auth_provider=auth_provider)
session = cluster.connect()

In [ ]:
session.execute("use emad")

In [ ]:
session.execute("""
    create table if not exists emad.taxi (
        vendor_id text,
        pickup_datetime text,
        dropoff_datetime text,
        passenger_count int,
        trip_distance float,
        payment_type text,
        fare_amount float,
        extra float,
        mta_tax float,
        tip_amount float,
        tolls_amount float ,
        imp_surcharge float,
        zone_id text,
        dropofflocationid text,
        zone_name text,
        borough text,
        duration float,
        time_of_day text,
        id text,
        Primary key (id)
 	);
""")

In [ ]:
df=sdf.toPandas()

In [ ]:
i = len(df)
i

19220

In [ ]:
for x in range(0,i-19000):
    session.execute("insert into emad.taxi(vendor_id,pickup_datetime,dropoff_datetime,passenger_count,trip_distance,payment_type,fare_amount,extra,mta_tax,tip_amount,tolls_amount,imp_surcharge,zone_id,dropofflocationid,zone_name,borough,duration,time_of_day,id) values (%s,%s,%s,%s,%s,%s,%s,%s,%s,%s,%s,%s,%s,%s,%s,%s,%s,%s,%s);" , (str(df.loc[x].vendor_id), str(df.loc[x].pickup_datetime), str(df.loc[x].dropoff_datetime), int(df.loc[x].passenger_count), float(df.loc[x].trip_distance),str(df.loc[x].payment_type),float(df.loc[x].fare_amount),float(df.loc[x].extra),float(df.loc[x].mta_tax),float(df.loc[x].tip_amount),float(df.loc[x].tolls_amount),float(df.loc[x].imp_surcharge),str(df.loc[x].zone_id),str(df.loc[x].dropoff_location_id),str(df.loc[x].zone_name),str(df.loc[x].borough),int(df.loc[x].duration),str(df.loc[x].time_of_day),str(x)))

In [ ]:
# session.execute("select passenger_count,AVG(tip_amount) as average_tip_amount from emad.taxi GROUP BY passenger_count")

In [ ]:
# session.execute("""SELECT time_of_day,payment_type,COUNT(*) as number_of_trips 
# FROM emad.taxi 
# GROUP BY time_of_day,payment_type 
# """)

In [ ]:
# session.execute("select zone_id,zone_name,COUNT(*) as number_of_trips from emad.taxi GROUP BY zone_id,zone_name ")

In [ ]:
session.execute("alter table emad.taxi add total_amountt float;")
table= session.execute(" select * from emad.taxi;")
counter = 0 
total = []
for j in table:
        counter = counter + 1
        total = (j[6]+ j[7]+ j[8]+ j[5]+ int(j[13]) + int(j[14]))
        session.execute("update emad.taxi set total_amountt = {0} where id='{1}';".format(total,j[0]))

Mongo

In [ ]:
import pymongo
from pymongo import MongoClient
import json
from bson.json_util import dumps

In [ ]:
!pip install dnspython

Looking in indexes: https://pypi.org/simple, https://us-python.pkg.dev/colab-wheels/public/simple/
Collecting dnspython
  Downloading dnspython-2.2.1-py3-none-any.whl (269 kB)
     |████████████████████████████████| 269 kB 4.2 MB/s
Installing collected packages: dnspython
Successfully installed dnspython-2.2.1

In [ ]:
# connecting to MongoDB

cluster = MongoClient("mongodb+srv://admin:admin@bigdata.bysf2.mongodb.net/?retryWrites=true&w=majority")
# connecting to the DB
db = cluster["bigdata"]
# connecting to the cluster
collection = db["taxis"]

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 19220 entries, 0 to 19219
Data columns (total 18 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   vendor_id            19220 non-null  int64
 1   pickup_datetime      19220 non-null  object
 2   dropoff_datetime     19220 non-null  object
 3   passenger_count      19220 non-null  int64
 4   trip_distance        19220 non-null  float64
 5   payment_type         19220 non-null  int64
 6   fare_amount          19220 non-null  float64
 7   extra                19220 non-null  float64
 8   mta_tax              19220 non-null  float64
 9   tip_amount           19220 non-null  float64
 10  tolls_amount         19220 non-null  float64
 11  imp_surcharge        19220 non-null  float64
 12  zone_id              19220 non-null  int64
 13  dropoff_location_id  19220 non-null  int64
 14  zone_name            19220 non-null  object
 15  borough              19220 non-null  object
 16  duration             19220 non-null  timedelta64[ns]
 17  time_of_day          19220 non-null  object
dtypes: float64(7), int64(5), object(5), timedelta64[ns](1)
memory usage: 2.8+ MB

In [ ]:
collection.insert_many(df.apply(lambda x: x.to_dict(), axis=1).to_list())

In [ ]:
total_trip_cost = collection.aggregate([
    {
        "$project":{
            "fare_amount": "$fare_amount",
            "extra": "$extra",
            "mta_tax": "$mta_tax",
            "tip_amount": "$tip_amount",
            "tolls_amount": "$tolls_amount",
            "imp_surcharge": "$imp_surcharge",
            "total_trip_cost": {"$sum": ['$fare_amount', '$extra' , '$mta_tax', '$tip_amount', '$tolls_amount', '$imp_surcharge']}
        }
    }
])


result_list = list(total_trip_cost)

for i in result_list:
    collection.update_one({'_id': i.get("_id")}, {"$set": {'total_trip_cost': i.get("total_trip_cost")}})

In [ ]:
#6
result = collection.aggregate([
    {
        "$match":{
            "time_of_day": {"$exists": True}
        }
    },
    {
        "$group": {"_id": {"time_of_day": "$time_of_day", "payment_type": "$payment_type"}}
    },
    {
        "$sort": {"count": -1}
    },
    {
        "$limit": 4
    }
])

print(list(result))

[{'_id': {'time_of_day': 'afternoon', 'payment_type': 3}}, {'_id': {'time_of_day': 'night', 'payment_type': 3}}, {'_id': {'time_of_day': 'morning', 'payment_type': 3}}, {'_id': {'time_of_day': 'night', 'payment_type': 2}}]

In [ ]:
#7
result = collection.aggregate([
    {
        "$match":{
            "passenger_count": {"$exists": True}
        }
    },
    {
        "$group": {"_id": {"passenger_count": "$passenger_count"}, "avg": {"$avg": "$tip_amount"}}
    },
    {
        "$sort": {"avg": -1}
    }
])

print(list(result))

[{'_id': {'passenger_count': 4}, 'avg': 1.9235492957746478}, {'_id': {'passenger_count': 6}, 'avg': 1.8951905626134302}, {'_id': {'passenger_count': 5}, 'avg': 1.8295862068965518}, {'_id': {'passenger_count': 1}, 'avg': 1.824198250728863}, {'_id': {'passenger_count': 2}, 'avg': 1.7997718631178707}, {'_id': {'passenger_count': 3}, 'avg': 1.7691456077015644}]

In [ ]:
#8
result = collection.aggregate([
    {
        "$match":{
            "zone_name": {"$exists": True}
        }
    },
    {
        "$group": {"_id": {"zone_name": "$zone_name"}, "count": {"$sum": 1}}
    },
    {
        "$sort": {"count": -1}
    },
    {
        "$limit": 5
    }
])
        
print(list(result))

[{'_id': {'zone_name': 'Upper East Side South'}, 'count': 791}, {'_id': {'zone_name': 'Midtown Center'}, 'count': 744}, {'_id': {'zone_name': 'Upper East Side North'}, 'count': 713}, {'_id': {'zone_name': 'Times Sq/Theatre District'}, 'count': 692}, {'_id': {'zone_name': 'Midtown East'}, 'count': 667}]